{

  "intro": [
    {
      "id": "",
      "body": [
        "{1}"
      ],
      "media": [
        {
          "Cloudy Logic Main": "./about/media/visual/cloudy.gif"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    },
    {
      "id": "overview",
      "body": [
        "Cloudy Logic is a piece of philosophical writing and a multimedia artwork hosted online, made up of several narratives that broadly contemplate representations and the nature of knowledge. It is inspired by an article of the same name [1] in which parallels are made between machine learning systems and pseudo-rational practices such as astrological forecasting: essentially, masquerading superstitions in empirical terms to make them seem more credible. The relevance of these topics will be discussed throughout my documentation—divided into five sections: an introduction that provides a brief summary of the project, its aims and target audience; a research page that expands on the theoretical and conceptual dimensions of the work; an experience page breaking down the user journey as it was designed; a page for reflecting on the work, its development, significance and how it connects to Information Experience Design; and lastly, a future page where I briefly speculate on potential collaborators and sites for the work and any future iterations thereof."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[1]": "James, R. (2015). (1). See also: Adorno, T. (1957). (2)."
        }
      ],
      "links": [
        {
          "Cloudy Logic": "https://thenewinquiry.com/cloudy-logic/"
        },
        {
          "The Stars Down to Earth": "http://basis-frankfurt.de/sites/default/files/pictures/adorno.pdf"
        }
      ]
    },
    {
      "id": "aims",
      "body": [
        "Most machine learning systems may be broken down into three main components: data representation (how information is fed into the network), objective function (a way to represent the problem) and optimisation method (the means to achieve our objective). Bias, in this context, is often associated with its negative connotations (e.g. racial bias) or in a more technical sense with underfitting (i.e. failure to capture underlying patterns in the data). The mainstream conversation rarely addresses (inductive) bias for its utility, as the double-edged sword: assumptions and prior beliefs help learning algorithms distinguish signal from noise [2]. So how should we frame the conversation around bias in AI to constructively discuss the implications of its real-world applications? With Cloudy Logic, my aim is to broaden the conversation beyond the technologically attuned. In the visual manifesto, I emphasise some of the less apparent (philosophical) aspects of machines learning—information, representations, assumptions, complexity and contextual sensitivity; and among other themes, these will be expanded on in the coming sections."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[2]": "An overview of priors: Goodfellow, I., Bengio, Y., & Courville, A. (2016). (1), p. 154."
        }
      ],
      "links": [
        {
          "Deep Learning": "http://www.deeplearningbook.org/contents/ml.html"
        }
      ]
    },
    {
      "id": "audience",
      "body": [
        "The work was originally conceived as a piece of internet art, due to the restrictions set on the physical exhibition of work in response to COVID-19. During prototyping, I explored various options for disseminating my work digitally, such as Discord (social platform) and a shared virtual machine (accessed using SSH and the command-line interface). The project targets a mixed audience: not only technologists and researchers already in the field but also any individuals specifically interested in the ethical implications of machine learning and AI -powered technologies (emerging rapidly and increasingly mediating our social space [3]). Developing the work for an online delivery opened up the experience to a broader audience. With no durational nor geographical restrictions, the work is available to anyone at no cost and on-demand. This considered, my intention was to design the system taking into account the affordances of both the technologically inclined as well as of those less computer literate—ultimately, producing an artwork that combines elements of essay-writing, data visualisation and experimental digital storytelling."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[3]": "'[The perception of our environments] is increasingly mediated by algorithms' and, alas, modifying our social and political organisation. Mittelstadt, B. D. et al. (2016). (1) in Big Data & Society."
        }
      ],
      "links": [
        {
          "The Ethics of Algorithms: Mapping the Debate": "https://journals.sagepub.com/doi/full/10.1177/2053951716679679"
        }
      ]
    }
  ],

  "research": [
    {
      "id": "background",
      "body": [
        "The diagram breaks down an area of my initial research, namely bias in relation to data, their collection and analysis. The list of biases is not exhaustive, and the categories are to some extent interchangeable (in the end it generally comes down to the human). I started thinking about bias in the context of ICTs when working on my MA dissertation—Latent Spaces: Construction of Meaning and Knowledge Through New Media, Art, and Artificial Neural Networks—a piece of writing in which I consider the human experience of algorithmically mediated (knowledge) representations and the ubiquitous infosphere [4]. I have since written more on the topic, for instance, a short paper [5] discussing the main points of the dissertation and a Philosophy on Medium -featured [6] article on the elusiveness of deep learning. In Cloudy Logic, I try to highlight the ambiguity of bias: an often misunderstood or misappropriated concept, for which exist various definitions depending on context. Due to the interdisciplinary nature of ML research, this feels an especially timely issue. And without specificity, the discourse is merely reduced to rhetoric—a scapegoat for a more expansive problem. As well as carrying out literary research I sought out professional expertise, to further understand some technical details and to map out how frequently these concerns are encountered in industry research."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[4]": "Floridi, L. (2014). (1)."
        },
        {
          "[5]": "Lintunen, E. (2019). (2)."
        },
        {
          "[6]": "Lintunen, E. (2020). (3)."
        }
      ],
      "links": [
        {
          "The Fourth Revolution: How the Infosphere is Reshaping Human Reality": "https://www.bbc.co.uk/news/business-29896412"
        },
        {
          "Latent Spaces: The High-Dimensional Infosphere": "https://dl.acm.org/doi/10.1145/3363384.3363395"
        },
        {
          "Elusive Deep Learning": "https://medium.com/@erik.lintunen/elusive-deep-learning-5cd209a1c278?sk=100acfc23af8e5a3adc457b10dbbee59"
        }
      ]
    },
    {
      "id": "themes & relevance",
      "body": [
        "<i>[A certain belief system advocates that] all observed objects exist only relative to the mode of observation by which they are detected, and all theoretical objects exist only relative to the conceptual framework in which they are conceived. It is impossible to know anything independently of the means by which it is known, so it makes no sense to speak of the objective world as it exists independently of all modes of inquiry.</i> [7] [8]",
        "Evidently, machine learning is multifaceted. The above map is in many ways incomplete; but an integral part of my process, with which I've tried to categorise these intricate components. Based on my conversations with experts and nonexperts in the field, there exist significant tensions between the business logic and the technical logic which, as deconstructed would form a complex web of fantastical promises, sleight of hand, hidden Turkers, scientific aspiration, intelligent solutions, poorly thought-out designs and heaps of stuff in between. The hype has often blown things out of proportion and distracts attention away from the real matters at hand. As Michael Jordan phrases the issue: 'the scope is less about the realisation of science-fiction dreams or nightmares of super-human machines, and more about the need for humans to understand and shape technology as it becomes ever more present and influential in their daily lives.' [9] And ultimately, as any output produced using ML is a function of its inputs, the human-in-the-loop should always remain a target of critical inquiry (whether they be legislators, programmers, contributors to datasets, etc.).",
        "<i>Men at some time are masters of their fates; The fault, dear Brutus, is not in our stars, But in ourselves, that we are underlings.</i> – Cassius (Shakespeare)",
        "As AI is rapidly increasing in complexity, its operational aspects may feel overwhelming but, in reality, the underlying concepts are relatively simple (elegantly so). Big Data poses no intrinsic danger; however, many of its manifestations are ethically questionable—predictive policing, automated legal decision-making, personalised advertising, and so on. Often, reinforcing existing biases and exploiting vulnerable individuals or groups. ML even at its current scale is revolutionary [10]; but as Robin writes, '[forecasting] only ever reproduces society and its most conventional norms, values, and practices.' [11]. The issue, in my mind, is a lack of regulation. Models optimised for metrics that translate to profits at the expense of personal health, human rights, political integrity and/or moral virtues, will clearly lead to an inequitable distribution of benefits from the technology. Works such as Cloudy Logic are addressing this by attempting to increase literacy in the field, namely by considering how information processing interrelates with social systems and knowledge production (and a relevant question to ask might be to do with how these relate to power and its distribution)."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[7]": "An Interview with Alan Wallace (2007): (1)."
        },
        {
          "[8]": "This resonates with the way in which Barad discusses epistemic apparatuses, that enable 'the production and reconfiguring of difference.' Barad, K. (2007). (2), p. 232."
        },
        {
          "[9]": "Jordan, M. (2018). (3)."
        },
        {
          "[10]": "For example: (4). But conversely, a potentially positive transformation: (5)."
        },
        {
          "[11]": "James, R. (6)."
        },
        {
          "[12]": "For example: Lane, M. (2020). (7)."
        }
      ],
      "links": [
        {
          "Hidden Dimensions": "https://cup.columbia.edu/author-interviews/wallace-hidden-dimensions"
        },
        {
          "Meeting the Universe Halfway": "https://read.dukeupress.edu/books/book/1068/Meeting-the-Universe-HalfwayQuantum-Physics-and"
        },
        {
          "Artificial Intelligence—The Revolution Hasn't Happened Yet": "https://medium.com/@mijordan3/artificial-intelligence-the-revolution-hasnt-happened-yet-5e1d5812e1e7"
        },
        {
          "Cambridge Analytica": "https://www.theguardian.com/news/2018/may/06/cambridge-analytica-how-turn-clicks-into-votes-christopher-wylie"
        },
        {
          "DeepMind AI Reduces Google Data Centre Cooling Bill by 40%": "https://deepmind.com/blog/article/deepmind-ai-reduces-google-data-centre-cooling-bill-40"
        },
        {
          "(op. cit.)": "https://thenewinquiry.com/cloudy-logic/"
        },
        {
          "Responsible Innovation: The Next Wave of Design Thinking": "https://medium.com/microsoft-design/responsible-innovation-the-next-wave-of-design-thinking-86bc9e9a8ae8"
        }
      ]
    },
    {
      "id": "in practice",
      "body": [
        "My material research will be detailed in the next section (in relation to the user experience). The final implementation is transparent: all code is open sourced and available to browse through the (1). The graph below illustrates the pace of the development process (representing lines of code committed between March and August 2020). The pattern may be explained by expanding on the Design Project timeline: time before May was used for conceptual development, research and prototyping. The committed code peaks at the end of May, in anticipation of the June deadline. After receiving feedback from my tutors, changes were implemented prior to the RCA2020 show launch in mid-July.",
        "{1}"
      ],
      "media": [
        {
          "GitHub Code +-": "./about/media/visual/github.jpg"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "GitHub repository": "https://github.com/pixel-tree/cloudy-logic"
        }
      ]
    }
  ],

  "experience": [
    {
      "id": "narrative",
      "body": [
        "{1}",
        "On the basis of my research, I decided to focus the narrative on the following topics, breaking down the work into five chapters:",
        "HUBBLE—information is physical, and data are always produced through some intermediate instruments and methods of measurement;",
        "CAUSTICS—models of natural phenomena are based on approximations (there are limits to the levels of accuracy at which we are able to measure and represent things, and a delicate balancing act in achieving the right proportion of general patterns to lower-level detail);",
        "NOISE—knowledge representations are based on assumptions (axioms, postulates, deductive and inductive reasoning, etc.);",
        "APOTHEOSIS—scientific determinism within the incredibly complex and entropy-rich world (often too many variables to consider); and",
        "CHAOS—the contextual sensitivity of systems that abide by exponential laws (the inability to deal with randomness)."
      ],
      "media": [
        {
          "Representations": "./about/media/visual/representation.png"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    },
    {
      "id": "prototyping",
      "body": [
        "{1}",
        "Several prototypes were developed before pursuing the browser-based system. The first of these utilised the command-line terminal (above). The user would connect to a shared virtual machine and experience the content through a restricted shell (with specific permissions for manipulating the system). However, considering my broad target audience as well as the restrictions that this would have placed on the work visually (limited to ASCII), I decided that a GUI was imperative. (In the end, a terminal interface was implemented in the browser, that combines functionality with a thematic connection to the narrative.)",
        "{2}",
        "I wanted to devise an experience that would mediate the stories in a playful manner. The historical legacy of prediction and forecasting technologies is rich with folklore of quasi-religious rituals, deities, experiments and prophecies, so it seemed suitable to weave the writings into a fictional narrative. Upon entry, the user is transported to the Temple of Apollo, where introduced to the high priestess—Pythia—the oracle of Delphi (above).",
        "{3}",
        "Another prototype was tested on Discord, using custom-built bots and role menus. This resulted in a fragmented and choice-based narrative, in the sense that all content presented to the user would be determined by various options selected throughout the journey. A key part of my testing was to pick an appropriate system for representing Pythia. I tested a state-of-the-art AI language model [13]; but ultimately, it was impractical for delivering information to the user. Though this might have added entertainment value, the practical and seemingly best dramaturgical decision was to develop Pythia into the main interface (for accessing the stories)—the bot recognises and acts on intents in the user's messages. Perhaps most importantly, as a result of this a material narrator emerged for the texts."
      ],
      "media": [
        {
          "Terminal MUD": "./about/media/visual/terminal.png"
        },
        {
          "Pythia / Temple of Apollo": "./about/media/visual/pythia.gif"
        },
        {
          "Discord": "./about/media/visual/discord.png"
        }
      ],
      "notes": [
        {
          "[13]": "GPT-2: a previous iteration of the contentious (1)."
        }
      ],
      "links": [
        {
          "GPT-3": "https://www.theguardian.com/commentisfree/2020/sep/08/robot-wrote-this-article-gpt-3"
        }
      ]
    },
    {
      "id": "visualising the manifesto",
      "body": [
        "The frontend of Cloudy Logic has been developed mainly in JavaScript, utilising frameworks such as Node for bundling the app, REGL for graphics programming and p5.js for creating interactive media. The interface has been developed without the use of a UI library and, instead, I have developed a bespoke sequencer system consisting of event listeners, conditionals and metadata tags (used to determine the order of events at specific points in time). By building something from scratch, I feel that I have developed an understanding of my materials (code, data structures, algorithms, the digitised Cartesian plane aka the 2D website canvas and networking in general); and I believe that there is significant value in challenging the status quo. Various software were used to physicalise the work (due to some unique requirement that each fulfilled, e.g. 3D modelling, interactivity, browser integration, etc.).",
        "After Effects—used for most 2D image manipulation.",
        "{1}",
        "REGL—used to illustrate a point about scientific determinism.",
        "{2}",
        "p5.js—visualising chaos theory interactively (sensitive dependence on initial conditions).",
        "{3}",
        "C4D—RBG, light and colour (digital representations of phenomena).",
        "{4}",
        "Paulstretch—for producing the soundscapes.",
        "<iframe width='100%' height='450' scrolling='no' frameborder='no' allow='autoplay' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/playlists/1144639525%3Fsecret_token%3Ds-8GdmTMiHmkW&color=%23060608&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true'></iframe>"
      ],
      "media": [
        {
          "After Effects example": "./about/media/visual/ae.gif"
        },
        {
          "REGL example": "./about/media/visual/regl.gif"
        },
        {
          "p5.js example": "./about/media/visual/p5.gif"
        },
        {
          "C4D example": "./about/media/visual/c4d.gif"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    },
    {
      "id": "user testing",
      "body": [
        "The main bulk of user testing (for the live version) was focussed on three key aspects: media elements, their layout, browser compatibility and overall aesthetics; the interface and its functionality; and narrative, its dramaturgy and overall flow. The UI was tested with individuals at various levels of digital literacy. In terms of affordances [14], my intention was to find a balance between a UX that would 1) challenge (the somewhat unusual first part in the Temple with little to indicate what follows—the purpose of which is to ignite a sense of discovery) and 2) not become a burdensome puzzle resulting in frustration. Based on overall feedback, I implemented a short introduction to provide context and instructions for proceeding directly to the stories. The work lasts for approximately 30-45 minutes if experienced in a single session, but the user is given the option of exploring individual chapters instead.",
        "Elements / OS / Browser",
        "{1}",
        "UI",
        "{2}",
        "UX / Narrative",
        "{3}"
      ],
      "media": [
        {
          "Testing Media Elements": "./about/media/visual/test-OS.png"
        },
        {
          "Interface Testing": "./about/media/visual/test-UI.png"
        },
        {
          "Walkthrough Test": "./about/media/visual/test-UX.png"
        }
      ],
      "notes": [
        {
          "[14]": "Gibson, J. (1979). (1) in The Ecological Approach to Visual Perception."
        }
      ],
      "links": [
        {
          "The Theory of Affordances": "http://cs.brown.edu/courses/cs137/readings/Gibson-AFF.pdf"
        }
      ]
    }
  ],

  "reflection": [
    {
      "id": "RCA2020",
      "body": [
        "{1}",
        "Beyond the pre-launch testing, the work has successfully found some of its target audience—indicated by the fact that it was featured in two guest-curated collections as part of RCA2020: (1) (John Maeda) and (2) (Anna Ridler). This is an honour in and of itself; but also both curators represent a specific niche I wanted to reach—established technologists with research experience in the field and individuals either working on or thinking about the ethical implications of AI, respectively.",
        "<i>Frankly, I expected to see more critical works like Cloudy Logic that address what happens when companies and entities in our world start to learn how to speaks machine — that will likely come in work by the future humanist technologists of the RCA.</i> – John Maeda.",
        "<i>It is also important to remember, as Erik Lintunen does in his writing and project 'Cloudy Logic' how complex and brittle these systems are – how they are 'precise, intricate and sensitive to contextual change' – and how hard it discuss and explore the nuances of how they actually work without a background in digital technologies or data practices. But these projects, and the other work across IED, open up and build a vocabulary and language around artificial intelligence for other creative practitioners and the wider general public and present an alternative way of engaging with machine learning.</i> – Anna Ridler"
      ],
      "media": [
        {
          "RCA2020 Collections": "./about/media/visual/rca2020.png"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "Humanistic Technologists Design for the Now": "https://2020.rca.ac.uk/collections/humanistic-technologists-design-for-the-now"
        },
        {
          "Data and AI": "https://2020.rca.ac.uk/collections/data-and-ai"
        }
      ]
    },
    {
      "id": "analytics",
      "body": [
        "This section includes some analytics from the show period of 15.7.-31.7.2020. All collected user data are anonymous and exclude geographical information. I sought advice from a tutor to discuss the ethics of this, and they suggested that I weave a disclosure into the narrative. This materialised as the greeting: be considerate with your words—these walls have ears!",
        "{1}",
        "Dialogflow offers sophisticated tools to analyse the performance of chatbots. Surprisingly, they provided little qualitative insight (hence the intentional lack of detail above). Instead, I built a dataset consisting of 50 randomly sampled conversations. For each, I recorded the number of user messages per session and the length of each message. From these, I constructed a heat map to visualise the conversation progression: the columns 1-50 on the x-axis represent individual users/sessions, and the y-axis is used to display the quantity of user messages within each. The colour represents the length of the message and an exact figure is provided below the graph (on hover)."
      ],
      "media": [
        {
          "Intent Path Data": "./about/media/visual/intents.png"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    },
    {
      "id": "",
      "body": [
        "A few conversations have been selected to be shared below. The first two are examples of interactions that follow my design; the third I suspect is spam but the rest are some peculiarities brought into the Temple. All sessions begin with the greeting: stranger, you seem lost–what has brought you to the sacred Temple of Apollo?",
        "{1}",
        "{2}",
        "{3}",
        "{4}",
        "{5}",
        "{6}",
        "The conversation data may be used to inform a better design for a future iteration of the project. From my analysis, I see that a significant proportion of conversations begin with a generic greeting; a large number of consecutive short messages indicates spam (though if the string length is often repeated there might be communication issues); and generally, users have engaged for 3-4 messages on average before switching to terse replies."
      ],
      "media": [
        {
          "Successful Conversation 1": "./about/media/visual/convo-1.png"
        },
        {
          "Successful Conversation 2": "./about/media/visual/convo-2.png"
        },
        {
          "Nasty Spam": "./about/media/visual/convo-spam.png"
        },
        {
          "Loss": "./about/media/visual/convo-loss.png"
        },
        {
          "Love": "./about/media/visual/convo-love.png"
        },
        {
          "Scared": "./about/media/visual/convo-scared.png"
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    },
    {
      "id": "links to IED",
      "body": [
        "There are several facets of the work that relate to Information Experience Design. Firstly, the somewhat novel way in which the information has been communicated. Secondly, the use of artistic methods in conducting user experience research. Given a more participatory design, an analysis of natural language and associated metadata could be very insightful in studying emergent behaviours in social and digital contexts (and in fact, an entire field of social data science has emerged). In terms of experience, intent recognition has potential beyond creating chatbots and sequencing content. For instance, it could be used to manipulate the parameters of interactive media: in theory, the capabilities of existing software (intent trees, speech recognition, etc.) allow for the design of sophisticated multimedia narratives.",
        "Contemplating more broadly, on how IED has influenced my practice, my interests have transcended a superficial fascination of data physicalisation toward a research-focussed direction grounded in real-world issues. New media has transformative potential: my view, aligned with Wallace and Barad, is that we construct our realities through material-discursive practices—the exchange of information with our surroundings—and therefore, new experiences are latent spaces for alternative ways in which to perceive and understand the world!"
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "": ""
        }
      ],
      "links": [
        {
          "": ""
        }
      ]
    }
  ],

  "future": [
    {
      "id": "",
      "body": [
        "As an online artwork, Cloudy Logic could exist as part of (1)—a collection of works described as 'projects that push the boundaries of art, technology, design and culture. Experiments inspire, teach, and delight.' As a research project, the work could be distributed via any other online platform with a focus on the social implications of ICTs.",
        "The work could also be physically exhibited with further development, as part of residencies such as (2), (3), (4), (5), among others. Interactive articles have emerged as a new type of computational communication medium, which leverage 'active reading techniques to make ideas more accessible to a broad range of people' and have been shown to improve retention [15].",
        "There is scope for further collaborations and this could include, for instance, research scientists in the field of ML (designing ways in which to physicalise their research) or social scientists (devising research methods for studying specific manifestations of bias). In these cases, the appropriate venue for publishing the work could be something like (6)."
      ],
      "media": [
        {
          "": ""
        }
      ],
      "notes": [
        {
          "[15]": "Hohman, F. et al. (2020). (7)."
        }
      ],
      "links": [
        {
          "Experiments with Google": "https://experiments.withgoogle.com"
        },
        {
          "Arts at CERN": "https://arts.cern"
        },
        {
          "Google Creative Lab": "https://github.com/googlecreativelab"
        },
        {
          "SPACE Art & Tech": "https://spacestudios.org.uk/art-technology-index/"
        },
        {
          "STARTS Residency": "https://vertigo.starts.eu"
        },
        {
          "Distill": "https://distill.pub/about/"
        },
        {
          "Communicating with Interactive Articles": "https://distill.pub/2020/communicating-with-interactive-articles/"
        }
      ]
    }
  ]

}
